lo22/av_22_proc4_modelHB_turbRAS_3.0.1_triangle_origin/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sides
    {
        type            patch;
        nFaces          8;
        startFace       4;
    }
    slope
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       12;
    }
    atmosphere
    {
        type            patch;
        nFaces          2;
        startFace       14;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       16;
    }
)

// ************************************************************************* //
