lo22/av_22_proc4_modelHB_turbRAS_3.0.1_triangle_origin/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	object	blockMeshDict;
}
convertToMeters 1;
vertices
(
	(5.000000	5.000000	1.000000	)		// 0
	(5.000000	10.000000	2.000000	)		// 1
	(10.000000	5.000000	3.000000	)		// 2
	(10.000000	10.000000	4.000000	)		// 3
	(5.000000	5.000000	6.000000	)		// 4
	(5.000000	10.000000	7.000000	)		// 5
	(10.000000	5.000000	8.000000	)		// 6
	(10.000000	10.000000	9.000000	)		// 7
);

blocks
(
	hex (0 2 2 1 4 4 4 4) (1 1 1) simpleGrading (1 1 1) // 0
	hex (2 3 3 1 7 7 7 7) (1 1 1) simpleGrading (1 1 1) // 1
	hex (2 4 4 6 7 7 7 7) (1 1 1) simpleGrading (1 1 1) // 2
	hex (1 5 5 4 7 7 7 7) (1 1 1) simpleGrading (1 1 1) // 3
	hex (1 4 4 2 7 7 7 7) (1 1 1) simpleGrading (1 1 1) // 4
);

edges
(
);

boundary
(
	sides
	{
		type patch;
		faces
		(
			(0	2	4	4)		// 0
			(6	4	4	2)		// 1
			(0	4	4	1)		// 2
			(4	5	5	1)		// 3
			(1	5	7	7)		// 4
			(7	7	3	1)		// 5
			(2	7	7	6)		// 6
			(2	3	7	7)		// 7
		);
	}

	slope
	{
		type wall;
		faces
		(
			(0	1	2	2)		// 0
			(3	3	2	1)		// 1
		);
	}
	atmosphere
	{
		type patch;
		faces
		(
			(4	7	7	5)		// 0
			(4	6	7	7)		// 1
		);
	}
);

mergePatchPairs
(
);
